#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ambrosia-serve/database-workspace/runs/run-Y1jLSB7Ux5rmiHjg

Waiting for the plan to start...

Terraform v1.9.8
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.geral: Refreshing...
data.aws_vpc.ambrosia_serve_vpc: Refreshing...
data.terraform_remote_state.geral: Refresh complete after 0s
data.aws_vpc.ambrosia_serve_vpc: Refresh complete after 0s [id=vpc-01525f58b2e30df1b]
aws_security_group.db: Refreshing state... [id=sg-042a20f8f73a414a2]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4: Refreshing state... [id=sgr-08930fdb176a56ebf]
aws_vpc_security_group_ingress_rule.postgresql: Refreshing state... [id=sgr-0953144bd11c7dd72]
aws_rds_cluster.cluster: Refreshing state... [id=ambrosia-serve-cluster]
aws_rds_cluster.cluster: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SESSION_TOKEN" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Y1jLSB7Ux5rmiHjg/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Y1jLSB7Ux5rmiHjg/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster.cluster must be replaced
-/+ resource "aws_rds_cluster" "cluster" {
      ~ allocated_storage                     = 1 -> (known after apply)
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:851725225519:cluster:ambrosia-serve-cluster" -> (known after apply)
      ~ availability_zones                    = [ # forces replacement
          - "us-east-1b",
            # (2 unchanged elements hidden)
        ]
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier_prefix             = (known after apply)
      ~ cluster_members                       = [] -> (known after apply)
      ~ cluster_resource_id                   = "cluster-S7G7VMEXIIMXGSMG6Z4PHME7DI" -> (known after apply)
      ~ db_subnet_group_name                  = "default" -> (known after apply)
      + db_system_id                          = (known after apply)
      ~ endpoint                              = "ambrosia-serve-cluster.cluster-cbw6ic2m2ucr.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "16.1" -> (known after apply)
      ~ hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      ~ iam_roles                             = [] -> (known after apply)
      ~ id                                    = "ambrosia-serve-cluster" -> (known after apply)
      - iops                                  = 0 -> null
      ~ kms_key_id                            = "arn:aws:kms:us-east-1:851725225519:key/7b7b6361-07c6-4424-b854-4508a63aacab" -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - performance_insights_enabled          = false -> null
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ reader_endpoint                       = "ambrosia-serve-cluster.cluster-ro-cbw6ic2m2ucr.us-east-1.rds.amazonaws.com" -> (known after apply)
        tags                                  = {
            "Name" = "ambrosia-serve-cluster"
        }
        # (32 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.cluster_instance_writer will be created
  + resource "aws_rds_cluster_instance" "cluster_instance_writer" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = "us-east-1a"
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + db_parameter_group_name               = "default.aurora-postgresql16"
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "16.1"
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "instance-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r7g.large"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = "03:23-03:53"
      + preferred_maintenance_window          = "wed:06:17-wed:06:47"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Name" = "instance-1"
        }
      + tags_all                              = {
          + "Environment" = "Production"
          + "Name"        = "instance-1"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve - Database"
        }
      + writer                                = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @felixrodrigo19, Action: `pull_request`, Working Directory: ``, Workflow: `CI - Infra Database`*